backend/app/controllers/api/v1/projects_controller.rb

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Teams"], ["description", "A great project"], ["created_at", "2023-09-04 12:47:31.089950"], ["updated_at", "2023-09-04 12:47:31.089950"]]
---
      def create
        @project = Project.new(project_params)

        respond_to do |format|
          if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def set_project
        @project = Project.find_by_id(params[:id])